app/controllers/bookings_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]
---
	def select_by_room
		@room = Room.find(params[:id])

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "holidays".* FROM "holidays" WHERE "holidays"."h_date" = ? LIMIT 1  [["h_date", "2015-06-23"]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."date" = '2015-06-11' AND "bookings"."room_id" = 4
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 6]]
---
	def new_booking
		@room = Room.find(params[:room_id])
		@user = User.find(session[:user_id])

		booking = Booking.new
		booking.date = Date.parse(params[:booking_date])
		booking.start_time = booking.date.to_datetime + Time.parse(params[:start]).seconds_since_midnight.seconds
		booking.end_time = booking.date.to_datetime + Time.parse(params[:end]).seconds_since_midnight.seconds
		booking.room = @room
		booking.user = @user

		if booking.date.saturday? || booking.date.sunday?
			render json:{message:"Booking Not Possible. It is weekend."}
			return
		end
		if Holiday.find_by_h_date(booking.date) != nil
			render json:{message:"Booking Not Possible. It is Holiday."}
			return
		end
		other_bookings =  Booking.where(date:Date.parse(params[:booking_date]), room:@room)

		my_logger.info("other booking#{other_bookings}")
		overlap = false
		other_bookings.each do |ob|
			if ob.overlaps?(booking)
				my_logger.info("overlap tru #{ob.user.id} with #{booking.user.id}")
				if ob.user.id == booking.user.id
					my_logger.info("destroy tru")
					ob.destroy

INSERT INTO "bookings" ("date", "start_time", "end_time", "room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
		if overlap
			render json:{message:"Booking Not Possible. Same slot is booked by another user for same room."}
		else
			booking.save

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		@booking = Booking.find(params[:id])