app/controllers/holiday_controller.rb

	def new_holiday
		holiday = Holiday.new()
		holiday.h_date =  Date.parse(params[:holiday_Date])
		if holiday.save
---
INSERT INTO "holidays" ("h_date", "created_at", "updated_at") VALUES (?, ?, ?)  [["h_date", "2015-06-23"], ["created_at", "2015-06-11 15:08:07.466849"], ["updated_at", "2015-06-11 15:08:07.466849"]]