app/controllers/rooms_controller.rb

	def new_room
		room = Room.new
		room.name = params[:room_name]
		if room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "confroom2"], ["created_at", "2015-06-11 15:25:47.840499"], ["updated_at", "2015-06-11 15:25:47.840499"]]

	def create
		@room = Room.new(room_params)
		@room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "conf1"], ["created_at", "2015-06-10 07:51:16.582663"], ["updated_at", "2015-06-10 07:51:16.582663"]]

	def show
		@room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", 1]]