app/controllers/users_controller.rb

	def create
	  @user = User.new(user_params)

	  @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "test1"], ["password", "test1"], ["created_at", "2015-06-09 07:54:54.353349"], ["updated_at", "2015-06-09 07:54:54.353349"]]